#### Import Data

In [5]:
import pandas as pd
df = pd.read_csv("dataset.csv")

#### Checking for nulls

In [6]:
df.info()
df.isnull().any()

# No nulls detected

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3761 entries, 0 to 3760
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         3761 non-null   int64
 1   experience_level  3761 non-null   object
 2   employment_type   3761 non-null   object
 3   job_title         3761 non-null   object
 4   salary            3761 non-null   int64
 5   salary_currency   3761 non-null   object
 6   salary_in_usd     3761 non-null   int64
 7   company_location  3761 non-null   object
 8   company_size      3761 non-null   object
dtypes: int64(3), object(6)
memory usage: 264.6+ KB

work_year           False
experience_level    False
employment_type     False
job_title           False
salary              False
salary_currency     False
salary_in_usd       False
company_location    False
company_size        False
dtype: bool

#### Checking for duplicates

In [7]:
df.duplicated(keep="first").any()

## Duplicates are present, keeping them in for now, as it is possible for different people to have the same job w/ same salary

True

#### Adding column for currency in MYR

In [8]:
df["salary_in_myr"] = df["salary_in_usd"] * 4.71
df["salary_in_myr"] = df["salary_in_myr"].astype("int")
df[["job_title","salary_in_usd","salary_in_myr"]]

## Added column for currency in MYR, converted to int to remove decimal values

                      job_title  salary_in_usd  salary_in_myr
0             Applied Scientist         213660        1006338
1             Applied Scientist         130760         615879
2          Data Quality Analyst         100000         471000
3       Compliance Data Analyst          30000         141300
4             Applied Scientist         204620         963760
...                         ...            ...            ...
3756   Principal Data Scientist         148261         698309
3757             Data Scientist          91237         429726
3758       Data Science Manager         190200         895842
3759  Machine Learning Engineer          45618         214860
3760             Data Scientist         412000        1940520

[3761 rows x 3 columns]

#### Exporting to processed_data.csv

In [9]:
df.to_csv("processed_data.csv", index = False)

## saved to processed_data.csv